import { useRef, useMemo, useEffect, useState } from 'react';

export default function articleNav() {
  const [hasMounted, setHasMounted] = useState(false);
  const [name, setName] = useState('');
  const [id, setID] = useState('');
  useEffect(() => {
    setHasMounted(true);
    var canUseDOM = !!(typeof window !== "undefined" && typeof window.document !== "undefined" && typeof window.localStorage !== "undefined");
    if (canUseDOM) {
      let result = new URLSearchParams(window.location.search);
      setID(result.get('id'));
      setName(result.get('name'));
    }
  }, []);
  return <div className='settle_accounts'>
    <div className='settle_accounts_title shadow_box'>
      <div>
        <span onClick={() => { window.history.back() }} className='prev'>{'〈'}</span>
        <span>{name}</span>
        <i></i>
      </div>
    </div>
    <div className='article_box'>
      <div className='article_title'>{name}</div>
      <div className='article_text'>
        {
          id == '' ? null : id == 2 ? <div>
            <p>Hultoo هو بائع تجزئة عبر الإنترنت يخدم حياة الموضة العالمية ، نحن ملتزمون بالأحذية ، والأحذية الرياضية ، والأحذية غير الرسمية ، والكعوب العالية ، والأحذية الجلدية ، والأحذية الرجالية ، والأحذية النسائية ، وحقائب السفر ، وحقائب Dior ، وحقائب الكتف ، وحقائب اليد ، والملابس المفضلة ، والملابس الرجالية ، سماعات الرأس وأكثر<img src="https://cdn.shopify.com/s/files/1/0617/7793/6534/files/33_480x480.jpg?v=1676368016" alt="" width="677" height="474" /></p>
            <p>تأسست في عام 2015 ، وحافظت الشركة دائمًا على هدفها الأصلي في ظل موجة التجارة الإلكترونية ، مما جعل المنتجات الأكثر توقعًا.من خلال التكنولوجيا الصناعية الحديثة وراحة وسائل النقل الحديثة ، يمكن للمستخدمين من جميع أنحاء العالم الاستمتاع بالموضة ومتابعة الموضة. مهمتنا هي أن نكون روادًا في هذه الصناعة وأن نجلب الموضة إلى الحياة. لقد جمعنا معلومات ثقافية من بلدان مختلفة ، واحترمنا مفهوم الجمال في مختلف البلدان ، واعتمدنا تقنيات وعمليات متطورة في التصميم والمشتريات لتلبية احتياجات المستهلكين بشكل كامل ، وصنع المنتجات التي تلبي السوق ، وتسليم المنتجات للعملاء بسرعة اليدين. لدينا قنوات لوجستية متخصصة ودعم فني ، ونسمح لكل عميل بالاستمتاع بهذه النتيجة. يمكننا تلبية احتياجات العملاء: الأجهزة المحمولة والإنترنت ووسائل التواصل الاجتماعي.</p>
            <p><img src="https://cdn.shopify.com/s/files/1/0617/7793/6534/files/11_480x480.jpg?v=1676368037" alt="" width="674" height="449" /></p>
            <p><br />في هولتو ، يمكنك تحديد الموضة وفقًا لحالتك المزاجية ، لتحديد استخدامك وملابسك ، وهنا يمكنك مشاهدة المنتجات التي تناسبك أنت وعائلتك ، لأن هدفنا الأصلي هو السماح للعملاء بالتعبير عن فرديتهم ، واستخدام مجموعة واسعة من المنتجات اختيارات منتج يناسب أي مناسبة أو مناسبة.</p>
            <p><img src="https://cdn.shopify.com/s/files/1/0617/7793/6534/files/22_480x480.jpg?v=1676368061" alt="" width="680" height="453" /></p>
          </div> : id == 1 ? <div>
            <article className="4ever-article">
              <p>يرجى الملاحظة:<br />نظرًا لزيادة الحجم وتأثير COVID-19 ، فإننا نواجه تأخيرات في المعالجة والشحن. لذلك ، قد يستغرق وصول طلبك وقتًا أطول من المعتاد ، ونحن نعمل بجد لتوصيله إليك في أسرع وقت ممكن.<br /><br />البريد الإلكتروني الذي تلقيته مع معلومات التتبع الخاصة بك هو أفضل مورد للتحديثات وتوقيت تسليم طلبك.<br /><br />بالإضافة إلى ذلك ، نؤكد لك أن أي تأخير في الشحن لن يؤثر على الإطار الزمني للإرجاع أو الاستبدال. تستند جميع عمليات الإرجاع والاستبدال إلى تاريخ تسليم طلبك.<br /><br />نشكرك على سعة صدرك لأننا نفي بالطلبات بأسرع ما يمكن وبأمان ونعتذر عن أي إزعاج.<br /><br />كيف يمكنك الاستمتاع بسياسة الشحن المجاني؟<br /><br />شحن مجاني للطلبات التي تزيد عن 79 دولارًا أمريكيًا. يجب أن تخضع كل من تكاليف الشحن وطريقة الشحن لما هو مذكور في صفحة الدفع ، وقد يختلف ذلك باختلاف وجهات التسليم<br /><br />متى سأستلم شحنتي بعد تقديم طلبي؟<br /><br />هناك نوعان من العوامل الرئيسية التي ستقرر متى ستتلقى الحزمة الخاصة بك.</p>
              <ol>
                <li>Item Processing Time: The processing time is the time it takes for the seller to prepare the item(s) for shipment. There are different processing times for different items depending on product category and volume. Usually it is around 5 to 7 working days to process.</li>
              </ol>
              <p>&nbsp; &nbsp; &nbsp; &nbsp;<img src="https://cdn.shopify.com/s/files/1/0663/5749/4006/files/1_480x480.png?v=1663236647" alt="" /></p>
              <ol start="2">
                <li>Shipping Method: Delivery time varies with shipping method. Time in transit varies depending on where you're located and where your package is coming from. You can also check the follow form for more detail about the delivery time:</li>
              </ol>
              <p>Affected by the coronavirus epidemic, it may lead to extension of the delivery time. In some areas or countries with serious epidemic , the delivery time may be twice as much as the normal standard.</p>
              <table border="1">
                <tbody>
                  <tr>
                    <td>
                      <p><strong><b>Shipping Method</b></strong></p>
                    </td>
                    <td>
                      <p><strong><b>Delivery Time</b></strong></p>
                    </td>
                    <td>
                      <p><strong><b>Area</b></strong></p>
                    </td>
                  </tr>
                  <tr>
                    <td rowspan="13">
                      <p><strong><b>Super Savings</b></strong></p>
                    </td>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>North America&nbsp;</b></strong>(USA )</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Oceanica</b></strong>&nbsp;(Australia)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(France Germany Belgium Luxembourg Netherlands)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(Sweden Portugal Italy)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(England)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(Finland Iceland Switzerland The Czech Republic Greece Austria)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(Norway Denmark Sweden Ireland Luxembourg Switzerland The Czech Republic Slovakia Poland Slovenia Romania Hungary Latvia Lithuania Estonia)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>North America&nbsp;</b></strong>(Canada Mexico)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>7-15 days</p>
                    </td>
                    <td>
                      <p><strong><b>South America&nbsp;</b></strong>(Columbia Chile Peru Argentina Venezuela Ecuador)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>7-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Asia&nbsp;</b></strong>(Korea Japan Philippines Vietnam Thailand Singapore Malaysia India Pakistan Kazakhstan Iran Israel Saudi Arabia Cyprus Palestine)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe&nbsp;</b></strong>(Croatia Ukraine Georgia Spain Russia)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Africa&nbsp;</b></strong>(Egypt Libya Morocco South Africa Niger Ghana Cote d'Ivoire Togo Sultan Guinea)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>5-12 days</p>
                    </td>
                    <td>
                      <p><strong><b>Oceanica&nbsp;</b></strong>(New Zealand)</p>
                    </td>
                  </tr>
                  <tr>
                    <td rowspan="6">
                      <p><strong><b>Expedited Shipping</b></strong></p>
                    </td>
                    <td>
                      <p>2-5 days</p>
                    </td>
                    <td>
                      <p><strong><b>Europe</b></strong>&nbsp;(Norway Denmark Sweden Finland France Ireland Belgium Netherlands Luxembourg Switzerland Germany Austria The Czech Republic Slovakia Poland Spain Portugal Italy Croatia Slovenia Romania Greece Hungary Ukraine Latvia Lithuania Georgia Estoni)<br /><strong><b>Europe&nbsp;</b></strong>England</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>2-5 days</p>
                    </td>
                    <td>
                      <p><strong><b>North America</b></strong>&nbsp;(USA Canada Mexico)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>2-5 days</p>
                    </td>
                    <td>
                      <p><strong><b>South America</b></strong>&nbsp;(Columbia Chile Peru Brazil Argentina Venezuela Ecuador)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>3-7 days</p>
                    </td>
                    <td>
                      <p><strong><b>Asia&nbsp;</b></strong>(Korea Japan Philippines Vietnam Thailand Singapore Malaysia India Pakistan Kazakhstan Israel Saudi Arabia Cyprus Palestine)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>2-5 days</p>
                    </td>
                    <td>
                      <p><strong><b>Africa</b></strong>&nbsp;(Egypt Libya Morocco South Africa Niger Ghana Cote d'Ivoire Togo Sultan Guinea)</p>
                    </td>
                  </tr>
                  <tr>
                    <td>
                      <p>2-5 days</p>
                    </td>
                    <td>
                      <p><strong><b>Oceanica&nbsp;</b></strong>(Australia New Zealand)</p>
                    </td>
                  </tr>
                </tbody>
              </table>
              <p>&nbsp;</p>
            </article>
          </div> : id == 0 ? <div>
            <p>الدفع مع Paypal</p>
            <p><img src="https://cdn.shopify.com/s/files/1/0663/5749/4006/files/Payment_480x480.png?v=1663236229" alt="" /></p>
            <p>1. مع PayPal ، يمكنك إرسال المدفوعات بسرعة وأمان عبر الإنترنت.<br /><br />2. من خلال PayPal ، يمكنك الدفع ببطاقة الائتمان أو بطاقة الخصم أو رصيد الحساب المصرفي.<br /><br />3. بمجرد تقديم طلبك ، ستتم إعادة توجيهك إلى موقع PayPal حيث يمكنك إجراء الدفع.</p>
          </div> : id == 3 ? <div>
            <div class="rte">
              <p>الأحكام والشروط</p>
              <p><span>نبسب ؛ نبسب ؛ موجود داخل نبسب ؛ تخضع أي حقوق أخرى مرتبطة بالموقع &amp; nbsp ؛ لقانون حقوق النشر والعلامات التجارية. لا يجوز لك إعادة الإنتاج للاستخدام العام أو التجاري بدون إذن كتابي صريح من&nbsp;</span><span></span><strong><a href="https://zostyles.co/">أ<span>&nbsp;</span></a><a href="https://zostyles.co/"><span>&nbsp;</span></a><a href="https://hultoo.com/" title="">Hultoo</a><a href="https://zostyles.co/"></a></strong><span>نبسب ؛. إذا كنت ترغب في إعادة إنتاج المحتوى الذي يظهر على موقعنا أو تخزينه أو نقله أو استخدامه بأي شكل من الأشكال ، فيرجى الاتصال بنا عبر البريد الإلكتروني: <a href="https://hultoo.com/">hultoo.com</a></span></p>
              <ol start="10"></ol>
            </div>
          </div> : id == 4 ? <div>
            <p>يمكننا فقط تقديم رصيد تخزين لأي عنصر يتم إرجاعه دوليًا بعد الاستلام. بالنسبة للإرجاع الدولي ، يمكننا قبول طلبات الإرجاع حتى 7 أيام بعد تاريخ التسليم ، وستحتاج إلى استخدام شركة الشحن الخاصة بك لإعادة العنصر إلينا. لشحن العناصر مرة أخرى إلى hultoo البريد الإلكتروني florindodionata12@outlook.com مع رقم الطلب وتفاصيل العنصر الذي ترغب في إرجاعه.<br />بمجرد تأكيد فريقنا وتقديم عنوان الإرجاع ، يرجى تعبئة العنصر والفاتورة في الحقيبة أو الصندوق.<br />يرجى ذكر رقم فاتورتك ووضع علامة على "إرجاع البضائع" في بوليصة الشحن الجوي. أرسل عودتك بالبريد باستخدام شركة النقل التي تختارها ، لاحظ أن إعادة الشحن ستكون على نفقتك الخاصة. فيما يتعلق بمسألة التبادل ، إذا كنت ترغب في الاستبدال ، فإن أسهل طريقة هي إرجاع منتجك من خلال العملية المذكورة أعلاه وتقديم طلب جديد ، أو الاتصال بموظفي خدمة العملاء الرسميين.</p>
          </div> : id == 5 ? <div>
            <p>شكرًا لك على زيارة hultoo.com ("الموقع").<br /><br />توضح سياسة الخصوصية والأمان هذه ("السياسة") المعلومات التي نجمعها عنك على موقع الويب ، بالإضافة إلى المعلومات التي تم جمعها عند زيارتك لمتاجرنا أو التواصل أو التواصل عبر موقع hultoo.com بالإضافة إلى بياناتي ، وكيفية استخدامنا للبيانات الشخصية المعلومات ، وبعض الخطوات الأمنية المتخذة لحماية المعلومات ، والخيارات التي يتعين عليك مراجعتها و / أو مراجعة و / أو تقييد استخدامنا لهذه المعلومات.<br /><br />هذه السياسة جزء من شروط وأحكام الاستخدام التي تحكم الموقع وهي ملزمة لجميع مستخدمي الموقع.<br /><br />إذا كان لديك أي اعتراضات على سياسة الخصوصية هذه ، فيجب عليك التوقف عن استخدام الموقع على الفور.</p>
            <ol>
              <li>كيف نستخدم بياناتك الشخصية؟<br />عند تقديم بياناتك الشخصية ، فإنك توافق على استخدامhultoo .com للبيانات التي تم جمعها من أجل الوفاء بالتزاماتنا تجاهك وتزويدك بالخدمة التي تتوقعها.<br /><br />نحتاج إلى بياناتك الشخصية للأغراض التالية:<br /><br />- لإنشاء حسابك الشخصي على hultoo.com (على سبيل المثال ، اسمك وعنوان بريدك الإلكتروني)<br /><br />- لمعالجة طلباتك (مثل اسمك وعنوانك وتفاصيل البنك)<br /><br />- لتتمكن من إرسال إشعارات الرسائل النصية بحالة التسليم (مثل رقم هاتفك المحمول)<br /><br />- لتتمكن من إرسال عروض تسويقية لك مثل النشرات الإخبارية وكتالوجاتنا (مثل عنوان بريدك الإلكتروني واسمك)<br /><br />- لتتمكن من الاتصال بك في حالة وجود أي مشكلة في تسليم العناصر الخاصة بك (مثل رقم الهاتف والعنوان)<br /><br />- لتمكيننا من الرد على استفساراتك وإبلاغك بالخدمات الجديدة أو المتغيرة (مثل عنوان بريدك الإلكتروني)<br /><br /> <br /><br />سنحتفظ ببياناتك فقط طالما كان ذلك ضروريًا لتنفيذ خدماتنا لك أو طالما أننا مطلوبون بموجب اللوائح.<br /><br />لا يمكننا إزالة بياناتك عندما يكون هناك متطلبات تخزين قانونية ، مثل قواعد حفظ الدفاتر أو عندما يكون هناك أساس قانوني للاحتفاظ بالبيانات ، مثل علاقة تعاقدية مستمرة.<br /><br />تُستخدم البيانات غير الشخصية على النحو الموضح أعلاه وبطرق أخرى حسبما تسمح به القوانين المعمول بها ، بما في ذلك دمج البيانات غير الشخصية مع البيانات الشخصية.<br /><br />بالإضافة إلى ذلك ، نحن نراقب استخدام الموقع وأنماط حركة المرور لتحسين تصميم موقع الويب والمنتجات والخدمات التي نقدمها وكذلك لتحديد العروض أو العروض الترويجية أو المعلومات التي نرسلها إليك.<br /><br />لخدمتك بشكل أفضل ، قد نقوم بدمج المعلومات الشخصية التي تقدمها لنا عبر الإنترنت ، أو عبر جهاز محمول ، أو في متاجرنا ، أو من خلال مركز اتصال خدمة العملاء لدينا.<br /><br />قد نقوم أيضًا بدمج هذه المعلومات مع المعلومات المتاحة للجمهور والمعلومات التي نتلقاها من المرجع التبادلي مع شركاء محددين وآخرين. من خلال دمج هذه المعلومات ، نكون أكثر قدرة على التواصل معك بشأن منتجاتنا وخدماتنا ، والأحداث الخاصة والعروض الترويجية ، ونكون أكثر قدرة على تخصيص تجربة التسوق الخاصة بك.</li>
            </ol>
            <p>&nbsp;&nbsp;</p>
            <ol start="2">
              <li>لديك الحق في طلب معلومات حول البيانات الشخصية التي نحتفظ بها عنك.<br />إذا كانت بياناتك غير صحيحة أو غير كاملة أو غير ذات صلة ، يمكنك أن تطلب تصحيح المعلومات أو إزالتها. سنويًا ، يحق لك أيضًا طلب وثائق مكتوبة ، مجانًا ، بشأن المعلومات الشخصية التي لدينا عنك في ملفات الحساب الخاصة بنا.<br /><br />لطلب هذا المستند ، يرجى الكتابة إلى خدمة عملاء hultoo.com. يمكنك سحب موافقتك على استخدام البيانات لأغراض التسويق في أي وقت (مثل إرسال الكتالوجات أو الرسائل الإخبارية أو العروض). يمكنك الاتصال بنا عبر الهاتف أو البريد الإلكتروني.</li>
            </ol>
            <p>&nbsp;&nbsp;</p>
            <ol start="3">
              <li>يمكنك الوصول إلى حسابك الشخصي لتحديث بياناتك الشخصية.<br />يرجى ملاحظة ، مع ذلك ، أن معلومات حسابك الشخصية محمية باسم المستخدم وكلمة المرور.<br /><br />تقع على عاتقك مسؤولية الحفاظ على أمان اسم المستخدم وكلمة المرور الخاصين بك لأن أي إجراءات يتم اتخاذها أثناء تسجيل الدخول إلى حسابك ستكون مسؤوليتك.</li>
            </ol>
            <p>&nbsp;</p>
            <ol start="4">
              <li>نحن لا نبيع معلوماتك لأطراف ثالثة.<br />ومع ذلك ، فإننا نشارك البيانات مع أطراف ثالثة عند الضرورة لتنفيذ معاملة أو إكمال خدمة أو لأغراض إدارية أو عندما يقتضي القانون ذلك.<br /><br />تُستخدم أي بيانات يتم إرسالها إلى جهات خارجية للوفاء بالتزامات <span>hultoo.com</span> تجاه y hultoo.com ، ويجوز لي أيضًا تقديم بياناتك الشخصية إلى مؤسسات مثل مرجع الائتمان أو وكالات تحصيل الديون لأغراض التحقق من الائتمان والتحقق من الهوية والمراقبة التصنيف الائتماني وتحصيل الديون.<br /><br />بالإضافة إلى ذلك ، سوف نشارك بياناتك إذا كانت هذه المشاركة مطلوبة بموجب القانون أو للحماية من الاحتيال المحتمل أو المشتبه به. أيضًا ، <span>hultoo.com</span>.com us Me يخضع لعملية اندماج أو إعادة تنظيم الشركة أو بيع أو شراء أصولنا بالكامل أو جزء منها من قبل طرف آخر ، وقد تتم مشاركة بياناتك الشخصية. إذا كنت لا تريد منا مشاركة بياناتك الشخصية بهذه الطرق ، فيرجى عدم تزويدنا بها.</li>
            </ol>
            <p>&nbsp;</p>
            <ol start="5">
              <li>ملف تعريف الارتباط هو جزء من البيانات المخزنة على القرص الصلب الخاص بالمستخدم يحتوي على معلومات حول المستخدم.<br />نحن نستخدم ملفات تعريف الارتباط الخاصة بالجلسة وملفات تعريف الارتباط الدائمة ، حيث تمكّننا ملفات تعريف الارتباط من تتبع واستهداف اهتمامات مستخدمينا بشكل إجمالي من خلال تحليل المناطق والمنتجات الشائعة لتعزيز التجارب المستقبلية على موقعنا.<br /><br />لا تتسبب ملفات تعريف الارتباط في إتلاف أنظمة الكمبيوتر أو الملفات الخاصة بك ، ولا يمكن قراءة ملفات تعريف الارتباط هذه أو تعديلها أو حذفها إلا من خلال موقع الويب الذي قام بنقل ملف تعريف ارتباط معين إليك.<br /><br />إذا كنت لا تريد جمع المعلومات من خلال استخدام ملفات تعريف الارتباط ، فهناك إجراءات بسيطة في معظم المتصفحات تسمح لك بحذف ملفات تعريف الارتباط الموجودة ، أو رفض ملفات تعريف الارتباط تلقائيًا ، أو منحك خيار رفض أو قبول نقل ملفات تعريف ارتباط معينة إلى حسابك حاسوب.<br /><br />يمكنك بسهولة مسح ملفات تعريف الارتباط من جهاز الكمبيوتر أو الجهاز المحمول باستخدام متصفحك. للحصول على إرشادات حول كيفية التعامل مع ملفات تعريف الارتباط وحذفها ، يرجى الاطلاع على "المساعدة" في متصفحك.<br /><br />يمكنك اختيار تعطيل ملفات تعريف الارتباط ، أو تلقي إشعار في كل مرة يتم فيها إرسال ملف تعريف ارتباط جديد إلى جهاز الكمبيوتر أو الجهاز المحمول الخاص بك. ومع ذلك ، يرجى ملاحظة أنه إذا اخترت تعطيل ملفات تعريف الارتباط ، فلن تتمكن من الاستفادة من جميع الميزات.</li>
            </ol>
            <ol start="6">
              <li>يتخذ موقع hultoo.com كل الاحتياطات اللازمة لحماية معلومات مستخدمينا.<br />عندما يطلب نموذج التسجيل / الطلب الخاص بنا من المستخدمين إدخال معلومات حساسة (مثل رقم بطاقة الائتمان و / أو رقم الضمان الاجتماعي) ، يتم تشفير هذه المعلومات وحمايتها باستخدام برنامج التشفير Secure Socket Layers (SSLs). أثناء التواجد في صفحة آمنة ، مثل نموذج الطلب الخاص بنا ، يظهر رمز قفل أسفل مستعرض الويب الخاص بك.<br /><br />عندما لا تكون في صفحة آمنة ، لن تظهر أيقونة قفل. بالإضافة إلى ذلك ، يتم الاحتفاظ بالخوادم التي نقوم بتخزين معلومات التعريف الشخصية عليها في بيئة آمنة تحت الوصول المقيد. ومع ذلك ، فإن أنظمة الأمان ليست معصومة من الخطأ ، بما في ذلك أنظمة التشفير.<br /><br />بينما نبذل جهودًا معقولة لحماية معلوماتك الشخصية ، لا يمكننا ضمان أمنها المطلق.<br /><br />إذا كان لديك أي أسئلة حول الأمن على موقعنا ، يرجى إرسال بريد إلكتروني إلينا على support@ohohpet.com لمزيد من المعلومات.</li>
            </ol>
            <p>&nbsp;</p>
            <ol start="7">
              <li>استكمال المعلومات.<br />لكي تفي hultoo.com بالتزاماتها بشكل صحيح تجاه عملائنا ، من الضروري أن نكمل المعلومات التي نتلقاها بمعلومات من مصادر خارجية مثل مواقع الويب التابعة لنا.<br /><br />على سبيل المثال ، سنجمع معلومات حول عادات الشراء للمستخدمين مع معلومات مماثلة من المواقع التابعة لنا.<br /><br />عندما يقوم المستخدم بعملية شراء من أي من هذه الشركات ، تقوم الشركات بجمع معلومات الشراء هذه ومشاركتها معنا حتى نتمكن من تخصيص الموقع وفقًا لتفضيلات مستخدمينا.<br /><br />إذا تغيرت معلومات التعريف الشخصية للمستخدم (مثل الرمز البريدي أو الهاتف أو البريد الإلكتروني أو العنوان البريدي) ، أو إذا لم يعد المستخدم يرغب في خدمتنا ، فإننا نقدم طريقة لتصحيح أو تحديث أو حذف / إلغاء تنشيط التعريف الشخصي لهذا المستخدم المعلومات المقدمة لنا. يمكن القيام بذلك باستخدام ميزة إلغاء الاشتراك في اتصالاتنا.<br /><br /> <br /><br />التغييرات التي تطرأ على هذه السياسة ، نحتفظ بالحق في تغيير سياسة الخصوصية هذه وأي من سياساتنا أو إجراءاتنا المتعلقة بمعالجة المعلومات التي تم جمعها من خلال الموقع ، دون إشعار مسبق ، ويمكنك تحديد تاريخ آخر مراجعة لسياسة الخصوصية هذه بالإشارة إلى التاريخ. في الجزء العلوي من هذه الصفحة. ستصبح أي تغييرات تطرأ على سياسة الخصوصية الخاصة بنا سارية عند نشر السياسة المنقحة على الإنترنت ، والتي يمكن الوصول إليها من خلال الموقع. يشكل استخدام الموقع بعد هذه التغييرات موافقتك على السياسة المعدلة في ذلك الوقت. نحن نشجعك على مراجعة سياسة الخصوصية الخاصة بنا بشكل دوري لضمان التعرف على أحدث إصدار لدينا.</li>
            </ol>
          </div> : id == 6 ? <div>
            يرجى الاتصال على whatsapp عبر الإنترنت للحصول على مزيد من المساعدة. سوف نقوم بالرد خلال 24 ساعة. شكرا لصبرك مقدما.
          </div> : null}
      </div>
    </div>
  </div>
}